benchmarking/config-comparison-results/go-db-memory-map-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: stress-test-optimized.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m15s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 1m45s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2025-09-13T14:56:30+01:00" level=info msg="Setting up optimized stress test..." source=console
time="2025-09-13T14:56:30+01:00" level=info msg="Note: This test assumes go-db is configured with -transaction-save=false" source=console
time="2025-09-13T14:56:30+01:00" level=info msg="Optimized stress test setup complete" source=console

running (0m01.0s), 002/100 VUs, 4 complete and 0 interrupted iterations
default   [   1% ] 002/100 VUs  0m00.8s/1m45.0s

running (0m02.0s), 003/100 VUs, 13 complete and 0 interrupted iterations
default   [   2% ] 003/100 VUs  0m01.8s/1m45.0s

running (0m03.0s), 004/100 VUs, 29 complete and 0 interrupted iterations
default   [   3% ] 004/100 VUs  0m02.8s/1m45.0s

running (0m04.0s), 005/100 VUs, 50 complete and 0 interrupted iterations
default   [   4% ] 005/100 VUs  0m03.8s/1m45.0s

running (0m05.0s), 007/100 VUs, 65 complete and 0 interrupted iterations
default   [   5% ] 007/100 VUs  0m04.8s/1m45.0s

running (0m06.0s), 008/100 VUs, 85 complete and 0 interrupted iterations
default   [   6% ] 008/100 VUs  0m05.8s/1m45.0s

running (0m07.0s), 009/100 VUs, 98 complete and 0 interrupted iterations
default   [   7% ] 009/100 VUs  0m06.8s/1m45.0s

running (0m08.0s), 010/100 VUs, 119 complete and 0 interrupted iterations
default   [   7% ] 010/100 VUs  0m07.8s/1m45.0s

running (0m09.0s), 012/100 VUs, 144 complete and 0 interrupted iterations
default   [   8% ] 012/100 VUs  0m08.8s/1m45.0s

running (0m10.0s), 013/100 VUs, 186 complete and 0 interrupted iterations
default   [   9% ] 013/100 VUs  0m09.8s/1m45.0s

running (0m11.0s), 014/100 VUs, 218 complete and 0 interrupted iterations
default   [  10% ] 014/100 VUs  0m10.8s/1m45.0s

running (0m12.0s), 015/100 VUs, 239 complete and 0 interrupted iterations
default   [  11% ] 015/100 VUs  0m11.8s/1m45.0s

running (0m13.0s), 017/100 VUs, 263 complete and 0 interrupted iterations
default   [  12% ] 017/100 VUs  0m12.8s/1m45.0s

running (0m14.0s), 018/100 VUs, 279 complete and 0 interrupted iterations
default   [  13% ] 018/100 VUs  0m13.8s/1m45.0s

running (0m15.0s), 019/100 VUs, 303 complete and 0 interrupted iterations
default   [  14% ] 019/100 VUs  0m14.8s/1m45.0s

running (0m16.0s), 021/100 VUs, 334 complete and 0 interrupted iterations
default   [  15% ] 021/100 VUs  0m15.9s/1m45.0s

running (0m17.0s), 023/100 VUs, 359 complete and 0 interrupted iterations
default   [  16% ] 023/100 VUs  0m16.8s/1m45.0s

running (0m18.0s), 025/100 VUs, 398 complete and 0 interrupted iterations
default   [  17% ] 025/100 VUs  0m17.8s/1m45.0s

running (0m19.0s), 027/100 VUs, 430 complete and 0 interrupted iterations
default   [  18% ] 027/100 VUs  0m18.8s/1m45.0s

running (0m20.0s), 029/100 VUs, 456 complete and 0 interrupted iterations
default   [  19% ] 029/100 VUs  0m19.8s/1m45.0s

running (0m21.0s), 031/100 VUs, 482 complete and 0 interrupted iterations
default   [  20% ] 031/100 VUs  0m20.8s/1m45.0s

running (0m22.0s), 033/100 VUs, 505 complete and 0 interrupted iterations
default   [  21% ] 033/100 VUs  0m21.8s/1m45.0s

running (0m23.0s), 035/100 VUs, 532 complete and 0 interrupted iterations
default   [  22% ] 035/100 VUs  0m22.8s/1m45.0s

running (0m24.0s), 037/100 VUs, 566 complete and 0 interrupted iterations
default   [  23% ] 037/100 VUs  0m23.8s/1m45.0s

running (0m25.0s), 039/100 VUs, 592 complete and 0 interrupted iterations
default   [  24% ] 039/100 VUs  0m24.8s/1m45.0s

running (0m26.0s), 041/100 VUs, 623 complete and 0 interrupted iterations
default   [  25% ] 041/100 VUs  0m25.8s/1m45.0s

running (0m27.0s), 043/100 VUs, 640 complete and 0 interrupted iterations
default   [  26% ] 043/100 VUs  0m26.8s/1m45.0s

running (0m28.0s), 045/100 VUs, 675 complete and 0 interrupted iterations
default   [  27% ] 045/100 VUs  0m27.8s/1m45.0s

running (0m29.0s), 047/100 VUs, 696 complete and 0 interrupted iterations
default   [  27% ] 047/100 VUs  0m28.8s/1m45.0s

running (0m30.0s), 049/100 VUs, 706 complete and 0 interrupted iterations
default   [  28% ] 049/100 VUs  0m29.8s/1m45.0s

running (0m31.0s), 051/100 VUs, 754 complete and 0 interrupted iterations
default   [  29% ] 051/100 VUs  0m30.8s/1m45.0s

running (0m32.0s), 053/100 VUs, 778 complete and 0 interrupted iterations
default   [  30% ] 053/100 VUs  0m31.8s/1m45.0s

running (0m33.0s), 054/100 VUs, 796 complete and 0 interrupted iterations
default   [  31% ] 054/100 VUs  0m32.8s/1m45.0s

running (0m34.0s), 056/100 VUs, 812 complete and 0 interrupted iterations
default   [  32% ] 056/100 VUs  0m33.8s/1m45.0s

running (0m35.0s), 058/100 VUs, 821 complete and 0 interrupted iterations
default   [  33% ] 058/100 VUs  0m34.8s/1m45.0s

running (0m36.0s), 059/100 VUs, 857 complete and 0 interrupted iterations
default   [  34% ] 059/100 VUs  0m35.8s/1m45.0s

running (0m37.0s), 061/100 VUs, 876 complete and 0 interrupted iterations
default   [  35% ] 061/100 VUs  0m36.8s/1m45.0s

running (0m38.0s), 063/100 VUs, 898 complete and 0 interrupted iterations
default   [  36% ] 063/100 VUs  0m37.8s/1m45.0s

running (0m39.0s), 064/100 VUs, 908 complete and 0 interrupted iterations
default   [  37% ] 064/100 VUs  0m38.8s/1m45.0s

running (0m40.0s), 066/100 VUs, 945 complete and 0 interrupted iterations
default   [  38% ] 066/100 VUs  0m39.8s/1m45.0s

running (0m41.0s), 068/100 VUs, 958 complete and 0 interrupted iterations
default   [  39% ] 068/100 VUs  0m40.8s/1m45.0s

running (0m42.0s), 069/100 VUs, 985 complete and 0 interrupted iterations
default   [  40% ] 069/100 VUs  0m41.8s/1m45.0s

running (0m43.0s), 071/100 VUs, 1021 complete and 0 interrupted iterations
default   [  41% ] 071/100 VUs  0m42.8s/1m45.0s

running (0m44.0s), 073/100 VUs, 1058 complete and 0 interrupted iterations
default   [  42% ] 073/100 VUs  0m43.8s/1m45.0s

running (0m45.0s), 074/100 VUs, 1098 complete and 0 interrupted iterations
default   [  43% ] 074/100 VUs  0m44.8s/1m45.0s

running (0m46.0s), 076/100 VUs, 1133 complete and 0 interrupted iterations
default   [  44% ] 076/100 VUs  0m45.8s/1m45.0s

running (0m47.0s), 078/100 VUs, 1161 complete and 0 interrupted iterations
default   [  45% ] 078/100 VUs  0m46.8s/1m45.0s

running (0m48.0s), 079/100 VUs, 1181 complete and 0 interrupted iterations
default   [  46% ] 079/100 VUs  0m47.8s/1m45.0s

running (0m49.0s), 081/100 VUs, 1216 complete and 0 interrupted iterations
default   [  47% ] 081/100 VUs  0m48.8s/1m45.0s

running (0m50.0s), 083/100 VUs, 1241 complete and 0 interrupted iterations
default   [  47% ] 083/100 VUs  0m49.8s/1m45.0s

running (0m51.0s), 084/100 VUs, 1249 complete and 0 interrupted iterations
default   [  48% ] 084/100 VUs  0m50.8s/1m45.0s

running (0m52.0s), 086/100 VUs, 1285 complete and 0 interrupted iterations
default   [  49% ] 086/100 VUs  0m51.8s/1m45.0s

running (0m53.0s), 088/100 VUs, 1327 complete and 0 interrupted iterations
default   [  50% ] 088/100 VUs  0m52.8s/1m45.0s

running (0m54.0s), 089/100 VUs, 1362 complete and 0 interrupted iterations
default   [  51% ] 089/100 VUs  0m53.8s/1m45.0s

running (0m55.0s), 091/100 VUs, 1386 complete and 0 interrupted iterations
default   [  52% ] 091/100 VUs  0m54.8s/1m45.0s

running (0m56.0s), 093/100 VUs, 1405 complete and 0 interrupted iterations
default   [  53% ] 093/100 VUs  0m55.8s/1m45.0s

running (0m57.0s), 094/100 VUs, 1415 complete and 0 interrupted iterations
default   [  54% ] 094/100 VUs  0m56.8s/1m45.0s

running (0m58.0s), 096/100 VUs, 1435 complete and 0 interrupted iterations
default   [  55% ] 096/100 VUs  0m57.8s/1m45.0s

running (0m59.0s), 098/100 VUs, 1491 complete and 0 interrupted iterations
default   [  56% ] 098/100 VUs  0m58.8s/1m45.0s

running (1m00.0s), 099/100 VUs, 1520 complete and 0 interrupted iterations
default   [  57% ] 099/100 VUs  0m59.8s/1m45.0s

running (1m01.0s), 100/100 VUs, 1538 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  1m00.8s/1m45.0s

running (1m02.0s), 100/100 VUs, 1571 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m01.8s/1m45.0s

running (1m03.0s), 100/100 VUs, 1611 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  1m02.8s/1m45.0s

running (1m04.0s), 100/100 VUs, 1642 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m03.8s/1m45.0s

running (1m05.0s), 100/100 VUs, 1658 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  1m04.8s/1m45.0s

running (1m06.0s), 100/100 VUs, 1685 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  1m05.8s/1m45.0s

running (1m07.0s), 100/100 VUs, 1700 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  1m06.8s/1m45.0s

running (1m08.0s), 100/100 VUs, 1729 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  1m07.8s/1m45.0s

running (1m09.0s), 100/100 VUs, 1752 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m08.8s/1m45.0s

running (1m10.0s), 100/100 VUs, 1774 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  1m09.8s/1m45.0s

running (1m11.0s), 100/100 VUs, 1789 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  1m10.8s/1m45.0s

running (1m12.0s), 100/100 VUs, 1810 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  1m11.8s/1m45.0s

running (1m13.0s), 100/100 VUs, 1823 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m12.8s/1m45.0s

running (1m14.0s), 100/100 VUs, 1832 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  1m13.8s/1m45.0s

running (1m15.0s), 100/100 VUs, 1856 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  1m14.8s/1m45.0s

running (1m16.0s), 100/100 VUs, 1874 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  1m15.8s/1m45.0s

running (1m17.0s), 100/100 VUs, 1884 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  1m16.8s/1m45.0s

running (1m18.0s), 100/100 VUs, 1903 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  1m17.8s/1m45.0s

running (1m19.0s), 100/100 VUs, 1926 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  1m18.8s/1m45.0s

running (1m20.0s), 100/100 VUs, 1955 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  1m19.8s/1m45.0s

running (1m21.0s), 100/100 VUs, 1988 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  1m20.8s/1m45.0s

running (1m22.0s), 100/100 VUs, 2008 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  1m21.8s/1m45.0s

running (1m23.0s), 100/100 VUs, 2022 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  1m22.8s/1m45.0s

running (1m24.0s), 100/100 VUs, 2044 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  1m23.8s/1m45.0s

running (1m25.0s), 100/100 VUs, 2084 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  1m24.8s/1m45.0s

running (1m26.0s), 100/100 VUs, 2094 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  1m25.8s/1m45.0s

running (1m27.0s), 100/100 VUs, 2109 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  1m26.8s/1m45.0s

running (1m28.0s), 100/100 VUs, 2128 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  1m27.8s/1m45.0s

running (1m29.0s), 100/100 VUs, 2181 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  1m28.8s/1m45.0s

running (1m30.0s), 100/100 VUs, 2207 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  1m29.8s/1m45.0s

running (1m31.0s), 100/100 VUs, 2234 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  1m30.8s/1m45.0s

running (1m32.0s), 098/100 VUs, 2276 complete and 0 interrupted iterations
default   [  87% ] 098/100 VUs  1m31.8s/1m45.0s

running (1m33.0s), 096/100 VUs, 2314 complete and 0 interrupted iterations
default   [  88% ] 096/100 VUs  1m32.8s/1m45.0s

running (1m34.0s), 096/100 VUs, 2322 complete and 0 interrupted iterations
default   [  89% ] 096/100 VUs  1m33.8s/1m45.0s

running (1m35.0s), 094/100 VUs, 2335 complete and 0 interrupted iterations
default   [  90% ] 094/100 VUs  1m34.8s/1m45.0s

running (1m36.0s), 093/100 VUs, 2350 complete and 0 interrupted iterations
default   [  91% ] 093/100 VUs  1m35.8s/1m45.0s

running (1m37.0s), 083/100 VUs, 2376 complete and 0 interrupted iterations
default   [  92% ] 083/100 VUs  1m36.8s/1m45.0s

running (1m38.0s), 072/100 VUs, 2410 complete and 0 interrupted iterations
default   [  93% ] 072/100 VUs  1m37.8s/1m45.0s

running (1m39.0s), 066/100 VUs, 2434 complete and 0 interrupted iterations
default   [  94% ] 066/100 VUs  1m38.8s/1m45.0s

running (1m40.0s), 059/100 VUs, 2450 complete and 0 interrupted iterations
default   [  95% ] 059/100 VUs  1m39.8s/1m45.0s

running (1m41.0s), 057/100 VUs, 2465 complete and 0 interrupted iterations
default   [  96% ] 057/100 VUs  1m40.8s/1m45.0s

running (1m42.0s), 044/100 VUs, 2485 complete and 0 interrupted iterations
default   [  97% ] 044/100 VUs  1m41.8s/1m45.0s

running (1m43.0s), 026/100 VUs, 2512 complete and 0 interrupted iterations
default   [  98% ] 026/100 VUs  1m42.8s/1m45.0s

running (1m44.0s), 015/100 VUs, 2535 complete and 0 interrupted iterations
default   [  99% ] 015/100 VUs  1m43.8s/1m45.0s

running (1m45.0s), 003/100 VUs, 2557 complete and 0 interrupted iterations
default   [ 100% ] 003/100 VUs  1m44.8s/1m45.0s
time="2025-09-13T14:58:15+01:00" level=info msg="Optimized stress test teardown complete" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✗ 'p(95)<500' p(95)=10s

    http_req_failed
    ✓ 'rate<0.01' rate=0.07%


  █ TOTAL RESULTS 

    checks_total.......: 2561    24.272067/s
    checks_succeeded...: 100.00% 2561 out of 2561
    checks_failed......: 0.00%   0 out of 2561

    ✓ stress batch insert status is 201
    ✓ stress find status is 200
    ✓ stress insert status is 201
    ✓ stress get by id status is 200 or 404
    ✓ stress update status is 200 or 404

    CUSTOM
    errors.........................: 0.00%  0 out of 0

    HTTP
    http_req_duration..............: avg=2.6s  min=170µs  med=400.24ms max=15.26s p(90)=8.49s p(95)=10s   
      { expected_response:true }...: avg=2.6s  min=233µs  med=400.67ms max=15.26s p(90)=8.49s p(95)=10s   
    http_req_failed................: 0.07%  2 out of 2564
    http_reqs......................: 2564   24.3005/s

    EXECUTION
    iteration_duration.............: avg=2.71s min=5.88ms med=532.53ms max=15.45s p(90)=8.63s p(95)=10.08s
    iterations.....................: 2561   24.272067/s
    vus............................: 3      min=2         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 3.3 MB 32 kB/s
    data_sent......................: 884 kB 8.4 kB/s



running (1m45.5s), 000/100 VUs, 2561 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  1m45s
time="2025-09-13T14:58:16+01:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"